package org.example;

public class Main {
    public static void main(String[] args) {
        //First level: 1. Необходимо описать три класса Cat, Dog, Pig.
        //
        //
        //
        //Добавить все необходимые поля с нужными  модификаторами доступа и соответствующими  getter и setter.
        //
        //Реализовать перегрузку конструкторов (без параметров, с двумя и со всеми параметрами).
        //
        //Реализовать для каждого класса свой метод say() - вывод на экран транскрипцию звука, который издает животное.
        //
        //Реализовать метод, выводящий на экран всю информацию об объекте в текстовом виде, Название параметра и значение параметра с новой строчки.
        //
        //Создать класс Main и функцию Main(), в которой реализовать создание трех экземпляров каждого из классов со всеми вариантами конструкторов.
        //
        //Для каждого объекта вызвать метод выводящий всю информацию о нем и метод say()
        //
        //В качестве выполненного задания прислать ссылку на git репозиторий
        //
        //Если будет возможность - пройти викторину https://quizizz.com/join?gc=40084669
    }
}