package org.hw10_12;

public class Homework {
//    First level: 1. создать лист, наполнить его 10М> елементами
//
//
//
//    внутри тела кладем i- тый элемент в переменную temp
//
//    перебрать for-each loop
//
//    classic for и вызываем list.size() для каждой итерации
//
//    classic for, но list.size() определяем в переменную
//
//    classic for, list.size() определяем в переменную, перебираем с конца (i--)
//
//    используя Itertor
//
//    используя ListIterator
//    для всех случаев сделать замер времени
//    результат вывести в консоль

}
